In [1]:
#! ipython suppress id=a299071e366b4bd590198b85b8625f2b
%pushd book-materials
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 25
pd.options.display.max_columns = 20
pd.options.display.max_colwidth = 82
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

url = "https://raw.githubusercontent.com/wesm/pydata-book/3rd-edition/"

[WinError 2] The system cannot find the file specified: 'book-materials'
C:\Users\Victor\Documents\Python Scripts\Training\Pydata_book

7.1 Handling Missing Data: 

sentinel value; 
dropna	Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.
fillna	Fill in missing data with some value or using an interpolation method such as "ffill" or "bfill".
isna	Return Boolean values indicating which values are missing/NA.
notna	Negation of isna, returns True for non-NA values and False for NA values.

these functions return new objects by default and do not modify the contents of the original object

In [2]:
#! ipython suppress id=835e9c4e6d3942638244064db595a5bd
import numpy as np
import pandas as pd

In [3]:
#! ipython id=290a88142afe4854bc724c7a6c735bae
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
#! ipython id=4b91ad05aea045cdbf13b5900cc1f73e
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
#! ipython id=8996ec87330f486b96f59f1f394ccf6a
# None: build-in value treated as NA
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data
string_data.isna()
float_data = pd.Series([1, 2, None], dtype='float64')
float_data
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [6]:
#! ipython id=6dfb795c00c24da9a66cdd66870f9fa9
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
#! ipython id=ce4c091e5f824312b06c6b1d6ff531fb
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
#! ipython id=be32168b85724034b62a96f6fb6e7f2c
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [9]:
#! ipython id=fc78d6354b4541f3a1c2416275e68c76
# Passing how="all" will drop only rows that are all NA
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
#! ipython id=87ba756b91eb4dd09d1b7e647a8ae7b9
data[4] = np.nan
data
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
#! ipython id=93bc1cf6fc10429a924cea596353e388
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df
df.dropna()
df.dropna(thresh=2)

          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [12]:
#! ipython id=ceee3ece49cc4169a1f8ac1e6954accd
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [13]:
#! ipython id=a03bb4bc12e24a3e941daa79068471ff
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.204708  0.500000  0.000000
1 -0.555730  0.500000  0.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

Table 7-2. fillna function arguments
Argument	Description
    value	Scalar value or dictionary-like object to use to fill missing values
    method	Interpolation method: one of "bfill" (backward fill) or "ffill" (forward fill); default is None
    axis	Axis to fill on ("index" or "columns"); default is axis="index"
    limit	For forward and backward filling, maximum number of consecutive periods to fill

In [14]:
#! ipython id=bf828716b9e04ef5a37200b5d5086b47
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df
df.fillna(method="ffill")
df.fillna(method="ffill", limit=2)

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761       NaN -2.370232
5 -1.265934       NaN -2.370232

In [15]:
#! ipython id=77b2b4714bd14dffb5e6b407fd0df952
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [16]:
#! ipython id=944377d16cdc466cb0a9e64fa1f79d5b
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [17]:
#! ipython id=bd2994de11fd4012a835bd0ee2bcf4cb
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [18]:
#! ipython id=ac1c8d333c8d40068f33556cee5cb8b4
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [192]:
#! ipython id=ac73e11080b04551bdf1a23729e75793
data["v1"] = range(7)
data
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [19]:
#! ipython id=eb735c97c9b744aa923b8fb94ae22f64
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [20]:
#! ipython id=4fd09f7a425741d5b1f61a28f2ec73a2
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [21]:
#! ipython verbatim id=1459d863e4e2488884aa21b5841fa88d
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [22]:
#! ipython id=a779fa7330de487fb907e801bf054696
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [14]:
#! ipython id=4c24af18964744eda625a480f5cdd126
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

KeyError: 'food'

In [15]:
#! ipython id=ec9f0e43f8da42ed8b3119331d09c853
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [16]:
#! ipython id=8fd47d92ab854f47bed89d8a72c9d8a0
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [17]:
#! ipython id=6bd3f8909caf4eed928f7164f277f8ef
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [18]:
#! ipython id=467da543042d473aa9ed8b43e5daefec
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [19]:
#! ipython id=e3dfba217f5a460d9bdf04ba573481ad
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [20]:
#! ipython id=103a514cd451404fbc7b559bab5ea87c
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [21]:
#! ipython id=aabdeea6a25f49a5a6949527b7d345bb
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [22]:
#! ipython id=8923ced04de44246b6d710395cc93348
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [23]:
#! ipython id=d125b3401a124c89a83007e36e3ee758
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [24]:
#! ipython id=5f8e0d6ff0b4445d886c8ee0fb478191
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [25]:
#! ipython id=5b066323cc4944c9938b36f4f8d52779
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [26]:
#! ipython id=075935d1c34b41ba9ee1842e23605ad1
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [27]:
#! ipython id=ce9e07485ac641e291688784a05e841c
age_categories.codes
age_categories.categories
age_categories.categories[0]
pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [28]:
#! ipython id=c40f7922de224c5682b37159bfb13adf
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [29]:
#! ipython id=5d5d56eba8384d11bd5d38c378c9fbf1
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [32]:
#! ipython id=33190ad9f1834874ba7cbd4066d8350b
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)

[(0.72, 0.95], (0.72, 0.95], (0.48, 0.72], (0.0017, 0.24], (0.24, 0.48], ..., (0.72, 0.95], (0.24, 0.48], (0.24, 0.48], (0.48, 0.72], (0.0017, 0.24]]
Length: 20
Categories (4, interval[float64, right]): [(0.0017, 0.24] < (0.24, 0.48] < (0.48, 0.72] < (0.72, 0.95]]

In [33]:
#! ipython id=5aa787199f2745d1a2358a097e9b23d9
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)
quartiles
pd.value_counts(quartiles)

(-3.76, -0.61]     250
(-0.61, -0.015]    250
(-0.015, 0.68]     250
(0.68, 3.26]       250
dtype: int64

In [34]:
#! ipython id=6df8a2f012ad4735bbc92d478d946e1f
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.746, -1.289]     100
(-1.289, -0.0147]    400
(-0.0147, 1.346]     400
(1.346, 3.26]        100
dtype: int64

In [35]:
#! ipython id=3979599fd2d247b7a32bf203a5c9a5c7
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013221     0.042930    -0.035968    -0.032888
std       1.016982     0.988873     0.963097     0.989135
min      -3.645860    -3.333767    -2.901831    -3.428254
25%      -0.666669    -0.610007    -0.703964    -0.731670
50%       0.038261     0.028040    -0.053723    -0.068581
75%       0.721104     0.695298     0.666145     0.629197
max       2.763474     3.525865     2.611678     3.366626

In [36]:
#! ipython id=14662c0a588c488d83d792107f20e528
col = data[2]
col[col.abs() > 3]

Series([], Name: 2, dtype: float64)

In [37]:
#! ipython id=2a1bb1c468cf40a58f3c5223a992b59b
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
10   0.682841  0.326045  0.425384 -3.428254
74   1.179227 -3.184377  1.369891 -1.074833
296 -3.548824  1.553205 -2.186301  1.277104
387 -0.578093  0.193299  1.397822  3.366626
534 -0.207434  3.525865  0.283070  0.544635
555 -3.645860  0.255475 -0.549574 -1.907459
777  0.336788 -3.333767 -1.240685 -0.650855
859 -3.018842 -0.298748  0.406954  0.183282
883  0.781753 -0.555434 -0.048478 -3.108915

In [38]:
#! ipython id=694246321bbd42adbb221b99486f388b
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.014434     0.042922    -0.035968    -0.032717
std       1.013020     0.985484     0.963097     0.986225
min      -3.000000    -3.000000    -2.901831    -3.000000
25%      -0.666669    -0.610007    -0.703964    -0.731670
50%       0.038261     0.028040    -0.053723    -0.068581
75%       0.721104     0.695298     0.666145     0.629197
max       2.763474     3.000000     2.611678     3.000000

In [39]:
#! ipython id=d70c02173fe945abad1450a5709b520e
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0  1.0  1.0 -1.0
2  1.0 -1.0 -1.0  1.0
3  1.0 -1.0 -1.0 -1.0
4  1.0  1.0  1.0 -1.0

In [40]:
#! ipython id=70d08ca5f48d48018126fd9ab1006314
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df
sampler = np.random.permutation(5)
sampler

array([4, 1, 3, 2, 0])

In [41]:
#! ipython id=f7c2008d514b4a549645c2c8a28861d9
df.take(sampler)
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [43]:
#! ipython id=ffbccf111b60408395f9eb116f6fc39a
column_sampler = np.random.permutation(7)
column_sampler
df.take(column_sampler, axis="columns")

    2   4   0   5   1   6   3
0   2   4   0   5   1   6   3
1   9  11   7  12   8  13  10
2  16  18  14  19  15  20  17
3  23  25  21  26  22  27  24
4  30  32  28  33  29  34  31

In [44]:
#! ipython id=c2429f2bce484acca0f590eed87cb896
df.sample(n=3)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [45]:
#! ipython id=f98970c0ba4942d880cf0d4076960bc3
choices = pd.Series([5, 7, -1, 6, 4])
choices.sample(n=10, replace=True)

1    7
2   -1
4    4
4    4
2   -1
3    6
3    6
3    6
1    7
3    6
dtype: int64

In [46]:
#! ipython id=590105f5b54b4b798b9c925339f1c000
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [47]:
#! ipython id=c9bf047cafa2489cb537d963eb18d16a
dummies = pd.get_dummies(df["key"], prefix="key")
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [48]:
#! ipython allow_exceptions id=e311a84ee00c40479411ed79fc5a6c69
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("https://raw.githubusercontent.com/wesm/pydata-book/3rd-edition/datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [49]:
#! ipython id=8e085399c22341ee9632bf5efcb4a6dc
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [50]:
#! ipython id=9b2a0b211d424f6798485b72bd572e08
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [51]:
#! ipython id=f3df965a3e024e918c1e67e647a6589a
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [52]:
#! ipython id=10771102e8084f5fa4a16200a93d058d
s = pd.Series([1, 2, 3, None])
s
s.dtype

dtype('float64')

In [53]:
#! ipython id=66923eb117b34b21b548507e349d387d
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s
s.isna()
s.dtype

Int64Dtype()

In [54]:
#! ipython id=8a80094d8808433599836ea7197e55b9
s[3]
s[3] is pd.NA

True

In [55]:
#! ipython id=43b53a40545c451c94728b65b40c574e
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [56]:
#! ipython id=85af440e08ae45d9b570c8b65f496567
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [239]:
#! ipython id=81a4d68317534367bdbd458b98a55329
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [240]:
#! ipython id=fe9efc6724224b7b9eccd32750524def
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [241]:
#! ipython id=9724ab6a052943e7803c2f855b47b29f
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [242]:
#! ipython id=e80b9a9828014622b86c088759d5e5a0
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [243]:
#! ipython id=06baf1c7f132476f90f73524278f5972
"::".join(pieces)

'a::b::guido'

In [244]:
#! ipython id=d5571ea9402c4182af832d4b0b659ad4
"guido" in val
val.index(",")
val.find(":")

-1

In [245]:
#! ipython allow_exceptions id=ee7ecc7978534b3883cf050a76245ba3
val.index(":")

ValueError: substring not found

In [246]:
#! ipython id=6c3ac8963e0348d5900d3b21f3d61421
val.count(",")

2

In [247]:
#! ipython id=2385159093a248abbb0b590843359737
val.replace(",", "::")
val.replace(",", "")

'ab  guido'

In [248]:
#! ipython id=b430b6ee3c904fa38a207e995ad4e152
import re
text = "foo    bar\t baz  \tqux"
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [249]:
#! ipython id=2af33f0f709d42a2853daaabafede024
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [250]:
#! ipython id=746b726a56dd4375a8a459b74d65789c
regex.findall(text)

['    ', '\t ', '  \t']

In [251]:
#! ipython verbatim id=8f2d09408b41491aa269044fc4375d93
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [252]:
#! ipython id=4efa726d3118445db3dfa63e69147a3e
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [253]:
#! ipython id=5d3ea127f5064a0eabafa8f07982c0fe
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [254]:
#! ipython id=56352eb1b66041658dc4a2df7cdd3659
print(regex.match(text))

None

In [255]:
#! ipython id=16b2b19e1790421f8cbfd96272f49964
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [256]:
#! ipython id=48a7da4e764149fc9fbbc73d8836e703
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [257]:
#! ipython id=0e0269c4dfb748a787340d99bd51af16
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [258]:
#! ipython id=ba6371f22b31476d99904236e025caf2
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [259]:
#! ipython id=adf56cb7344246a4981c9ccbc4520e45
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [260]:
#! ipython id=d2dae337d0724a7cabb69f0d2e45d21a
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [261]:
#! ipython id=b1a32c08159845ad97915762d2e9104c
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [262]:
#! ipython id=e83b7f3cb11b42ea8344da39bc8313ed
data_as_string_ext = data.astype('string')
data_as_string_ext
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [263]:
#! ipython id=abd3d1bd7239406d8d764f812cb04018
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [264]:
#! ipython id=07c02acaf03844578f9b18af036e96b4
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [265]:
#! ipython id=140f72f7ebdf44fc832ac76596f1f500
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [266]:
#! ipython id=086c74fc48364b859ab30d4c9278e96d
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [267]:
#! ipython id=5e0d1d0145d64d80870482f06001910e
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values
pd.unique(values)
pd.value_counts(values)

apple     6
orange    2
dtype: int64

In [268]:
#! ipython id=6b72957b5a1c4882828b5b6fc55bc645
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])
values
dim

0     apple
1    orange
dtype: object

In [269]:
#! ipython id=c4c6450bbb7f4c74b579d4cc989d0547
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [270]:
#! ipython id=922c7a3dfaf5478c8ece876bf6e8c8a4
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
rng = np.random.default_rng(seed=12345)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [271]:
#! ipython id=d3efa50a15b64f78b8ee5d1bffd9e3db
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [272]:
#! ipython id=5b3590609c7f4a2984add7aefc62727c
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [273]:
#! ipython id=4d5fd7e39e7b4dc4bf59a7597a66cbe1
c.categories
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [274]:
#! ipython id=a5d2afb03a3d46fe99b79633b5480fb7
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [275]:
#! ipython id=b4e849ae87304ac1a2b717ecafbf58c4
df['fruit'] = df['fruit'].astype('category')
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [276]:
#! ipython id=adba8c41d0094e49943f4c0f03bfb560
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [277]:
#! ipython id=dbb5b2424ba146f0b001398542f64ae3
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [278]:
#! ipython id=2ee990370ede41ddbcf285a6c1330ee0
ordered_cat = pd.Categorical.from_codes(codes, categories,
                                        ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [279]:
#! ipython id=27e720c7999143b8bc6fa95797bb78fd
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [280]:
#! ipython id=3268082ea833473888cb6df910208de8
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:5]

array([-1.4238,  1.2637, -0.8707, -0.2592, -0.0753])

In [281]:
#! ipython id=6d7daaf08a8240dea51848a3a6cc211d
bins = pd.qcut(draws, 4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [282]:
#! ipython id=6faabc704b9c436fa0e32ac6755e6359
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
bins
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [283]:
#! ipython id=0f2080e060dd4d848ff1a9d846c8a71e
bins = pd.Series(bins, name='quartile')
results = (pd.Series(draws)
           .groupby(bins)
           .agg(['count', 'min', 'max'])
           .reset_index())
results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [284]:
#! ipython id=4d1f92dfe8e34a6d8173c0aca18d8b55
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [285]:
#! ipython id=cb512af2f6bf4eb5b312ae330bd4c91e
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [286]:
#! ipython id=2978248572a743be8529a1668d424e8a
categories = labels.astype('category')

In [287]:
#! ipython id=a16f1610329347ffa2f28661941350b7
labels.memory_usage(deep=True)
categories.memory_usage(deep=True)

10000540

In [288]:
#! ipython id=dd7310d96d4d4c24bb7e3e9ad26b066f
%time _ = labels.astype('category')

CPU times: total: 312 ms
Wall time: 338 ms

In [289]:
#! ipython id=aca60c356d264f7c872287f1bfdf75c9
%timeit labels.value_counts()
%timeit categories.value_counts()

269 ms  5.36 ms per loop (mean  std. dev. of 7 runs, 1 loop each)
48.3 ms  878 s per loop (mean  std. dev. of 7 runs, 10 loops each)

In [290]:
#! ipython id=9dd1c0395c0743db8a283da215ae7f50
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [291]:
#! ipython id=84308427acbc491381531a16cd3bcc15
cat_s.cat.codes
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [292]:
#! ipython id=7b07ac0b91ef42809b1183ccc41555c1
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [293]:
#! ipython id=919709709a4c4c8d93e135d137ea0757
cat_s.value_counts()
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
dtype: int64

In [294]:
#! ipython id=0350789cd1fe41c6908b5e604ea34eb0
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [295]:
#! ipython id=c6b7347f928a4580b5dac67f798d9e28
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [296]:
#! ipython id=95950502e1bc4cfba88e7891c8062ee6
pd.get_dummies(cat_s)

   a  b  c  d
0  1  0  0  0
1  0  1  0  0
2  0  0  1  0
3  0  0  0  1
4  1  0  0  0
5  0  1  0  0
6  0  0  1  0
7  0  0  0  1

In [297]:
#! ipython suppress id=b8746f91160c4c9da000aeb4891514bf
%popd

C:\Users\Victor\Documents\Python Scripts\Training\Untitled Folder
popd -> ~\Documents\Python Scripts\Training\Untitled Folder

In [298]:
#! ipython suppress id=621a2c4436a44e5db40091b1e4f8a167
pd.options.display.max_rows = PREVIOUS_MAX_ROWS